# Data analysis and manipulation

### 0 - import pandas

In [2]:

import pandas as pd

In [8]:
# 1 - Datatype (series and Dataframe)

# series datatype
series_of_cars = pd.Series(["Toyota", "Tesla", "Honda", "Ford"])

In [6]:
series_of_cars

0    Toyota
1     Tesla
2     Honda
3      Ford
dtype: object

In [7]:
car_colors = pd.Series(["Red", "Silver", "Blue", "Beige"])

In [9]:
# Dataframe datatype
car_data = pd.DataFrame({"Car Type": series_of_cars, "Color": car_colors})
car_data

  Car Type   Color
0   Toyota     Red
1    Tesla  Silver
2    Honda    Blue
3     Ford   Beige

### Exercises
- Make a Series of different foods.
- Make a Series of different dollar values (these can be integers).
- Combine your Series's of foods and dollar values into a DataFrame.

In [13]:
foods_series = pd.Series(["Pizza", "Sandwich", "Pasta"])
prices = pd.Series([3.45, 4.50, 6.99])
food_data = pd.DataFrame({"Foods": foods_series, "Prices": prices})
food_data

      Foods  Prices
0     Pizza    3.45
1  Sandwich    4.50
2     Pasta    6.99

### 2 - Importing data

In [14]:

car_sales = pd.read_csv("car-sales.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

### 3 - Exporting the data

In [18]:

car_sales.to_csv("export_car_sales.csv")

## Exercises
- Practice importing a .csv file using pd.read_csv(), you can download heart-disease.csv. This file contains annonymous patient medical records and whether or not they have heart disease.
- Practice exporting a DataFrame using .to_csv(). You could export the heart disease DataFrame after you've imported it.

In [19]:
hd = pd.read_csv("heart-disease.csv")
hd

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
299,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0
300,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0
301,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

In [23]:
hd.to_csv("export-heart-disease.csv")

### 4 - Describing Data
Exploring the data in the DataFrame

In [24]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [25]:
# I would like to know the data type of each column
car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [26]:
# a statistical overview of the numerical columns
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [27]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [28]:
# Statiscal methods
car_sales.mean()

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [29]:
car_sales.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [30]:
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [32]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)